# GroundPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..GroundPlane Property
EnergyDataSettings Class See Also
---
Id of level which represents ground level.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GroundPlane { get; set; }
```

Visual Basic
---
```text
Public Property GroundPlane As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ GroundPlane {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
The ground plane defines what is above and below ground for Conceptual Energy Analysis. The ground plane can optionally used for the rendering cast shadows.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input element is not a level or invalidElementId. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace